EDT/Config/src/Catalogs/Задачи/Задачи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Задачи</name>
  <attributes>
    <name>Конфигурация</name>
    <type>
      <types>CatalogRef.Конфигурации</types>
    </type>
  </attributes>
  <attributes>
    <name>Файл</name>
    <type>
      <types>CatalogRef.Файлы</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВариантУсловияПоиска</name>
    <type>
      <types>EnumRef.ВариантыУсловийПоиска</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗавершения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>КачествоРешения</name>
    <type>
      <types>EnumRef.КачествоРешенияЗадачи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗадачи</name>
    <type>
      <types>CatalogRef.ТипыЗадач</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Условия</name>
    <attributes>
      <name>ВидПострочногоПоиска</name>
      <type>
        <types>EnumRef.ВидыПострочногоПоиска</types>
      </type>
    </attributes>
    <attributes>
      <name>ВариантПоиска</name>
      <type>
        <types>EnumRef.ВариантыПоиска</types>
      </type>
    </attributes>
    <attributes>
      <name>Условие</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>МеткаВКоде</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

EDT/Config/src/Enums/СостоянияЗадач/СостоянияЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияЗадач</name>
  <enumValues>
    <name>КВыполнению</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетПроверки</name>
  </enumValues>
  <enumValues>
    <name>Выполнено</name>
  </enumValues>
  <enumValues>
    <name>Отменено</name>
  </enumValues>
</mdclass:Enum>

EDT/Config/src/Enums/ВариантыУсловийПоиска/ВариантыУсловийПоиска.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВариантыУсловийПоиска</name>
  <enumValues>
    <name>ПоследовательныйПоискПоСтрокам</name>
  </enumValues>
  <enumValues>
    <name>ПерваяСтрокаФайла</name>
  </enumValues>
</mdclass:Enum>

EDT/Config/src/Catalogs/Задачи/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
   	
#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ДатаСоздания = ТекущаяДатаСеанса();
	
	Состояние = ОбщегоНазначения.ПредопределенныйЭлемент("Перечисление.СостоянияЗадач.КВыполнению");
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
	КонецЕсли;
	
КонецПроцедуры  

Процедура ПриКопировании(ОбъектКопирования)
	
	ДатаСоздания 	= ТекущаяДатаСеанса();
	ДатаЗавершения 	= Неопределено; 
	КачествоРешения = Неопределено;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МеткаУстановлена = Ложь;
	Для каждого УсловиеПоиска Из Условия Цикл
	
		МеткаУстановлена = Макс(МеткаУстановлена, УсловиеПоиска.МеткаВКоде);	
		
	КонецЦикла;     
	
	Если Не МеткаУстановлена Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru='Не указана локация метки в коде'"), , , , Отказ);	
	КонецЕсли;
	
	Если Состояние = ПредопределенноеЗначение("Перечисление.СостоянияЗадач.Выполнено") Тогда
		ПроверяемыеРеквизиты.Добавить("КачествоРешения");	
	КонецЕсли;
	
	Если ВариантУсловияПоиска = ПредопределенноеЗначение("Перечисление.ВариантыУсловийПоиска.ПерваяСтрокаФайла") Тогда
		ПроверяемыеРеквизиты.Добавить("Условия");	
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Состояние = Перечисления.СостоянияЗадач.ОжидаетПроверки И ДатаЗавершения = Дата(1, 1, 1) Тогда
		
			ДатаЗавершения = ТекущаяДатаСеанса();
					
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
